app/controllers/orders_controller.rb

SELECT "bouquets".* FROM "bouquets"
SELECT "shippings".* FROM "shippings"
---
  def new
    @order = Order.new
    @bouquets = Bouquet.all
    @shipping = Shipping.all

INSERT INTO "orders" ("recipient_name", "bouquet_id", "delivery_on", "status", "cost", "created_at", "updated_at", "shipping_id", "three_month_bundle") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    order = Order.new order_params

    if CreateOrder.new(order).create